<a href="https://colab.research.google.com/github/Tantatorn-dev/COVID19-Thailand/blob/master/covid19_thailand_cases.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Data Source
I retrieve data from Thailand [Department of Disease Control](https://https://covid19.th-stat.com/th/api)

# Data Preperation
Let's import data and extract the essence of it.

In [0]:
import json
import requests

url = "https://covid19.th-stat.com/api/open/cases"

# get response from api
res = requests.get(url)

# parse json object
json_data = res.json()
json_data = json_data['Data']

In [4]:
# convert data to pandas dataframe
import pandas as pd

data = pd.DataFrame(json_data)
data.head()

           ConfirmDate    No   Age  ...    District ProvinceEn Detail
0  2020-04-14 00:00:00  2613  50.0  ...     ไม่ระบุ    Bangkok   None
1  2020-04-14 00:00:00  2612  48.0  ...     บางกะปิ    Bangkok   None
2  2020-04-14 00:00:00  2611  39.0  ...                Bangkok   None
3  2020-04-14 00:00:00  2610  11.0  ...                Bangkok   None
4  2020-04-14 00:00:00  2609  60.0  ...  ทุ่งยางแดง    Pattani   None

[5 rows x 12 columns]

We'll see some column is useless. Let's drop it.

In [5]:
data = data.drop(columns=['Detail','ProvinceId','No','Gender','Nation','Province','District'])
data.head()

           ConfirmDate   Age GenderEn NationEn ProvinceEn
0  2020-04-14 00:00:00  50.0   Female     Thai    Bangkok
1  2020-04-14 00:00:00  48.0     Male     Thai    Bangkok
2  2020-04-14 00:00:00  39.0   Female     Thai    Bangkok
3  2020-04-14 00:00:00  11.0   Female     Thai    Bangkok
4  2020-04-14 00:00:00  60.0     Male     Thai    Pattani

In [7]:
# check for null data
pd.isnull(data)

      ConfirmDate    Age  GenderEn  NationEn  ProvinceEn
0           False  False     False     False       False
1           False  False     False     False       False
2           False  False     False     False       False
3           False  False     False     False       False
4           False  False     False     False       False
...           ...    ...       ...       ...         ...
2607        False  False     False     False       False
2608        False  False     False     False       False
2609        False  False     False     False       False
2610        False  False     False     False       False
2611        False  False     False     False       False

[2612 rows x 5 columns]

Okay all data is provided

# Summary
Let's draw some conclusion from data

In [6]:
# describe data we'll see only age because it is 
data.describe()

               Age
count  2608.000000
mean     37.860429
std      17.055239
min       0.000000
25%      27.000000
50%      36.000000
75%      49.000000
max      97.000000